Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/jobseekers_benefit.html.txt.tmx
Source language: en
Languages: ga

source: • How to apply • Where to apply
ga: • Conas iarratas a dhéanamh

source: Jobseeker's Benefit is a weekly payment from the Department of Social Protection (DSP) to people who are out of work and are covered by social insurance (PRSI)
ga: D'athraigh ainm na híocaíochta i 2006. Mura gcáilíonn tú le haghaidh Sochair Chuardaitheora Poist, d'fhéadfá le haghaidh Liúntas Cuardaitheora Poist a cháiliú

source: If you don't qualify for Jobseeker's Benefit you may qualify for Jobseeker's Allowance
ga: Is féidir an Réríomhán Tairbhe Oibre nua ón Roinn Coimirce Sóisialaí a úsáid

source: Intreo - the integrated employment and support service
ga: Intreo – an tseirbhís fhostaíochta agus tacaíochta comhtháite

source: Intreo is a service from the Department of Social Protection which provides a single point of contact for all employment and income supports
ga: Seirbhís nua ón Roinn Coimirce Sóisialaí is ea Intreo a soláthróidh pointe teagmhála aonair le haghaidh iomlán tacaíochtaí fostaíochta ioncaim

source: Details of Intreo locations are published on welfare.ie
ga: Foilseoidh sonraí de na láithreacha nua ar welfare.ie

source: To qualify for Jobseeker's Benefit you must be aged under 66 and:
ga: Chun a bheith i dteideal Sochar Cuardaitheora Poist ní mór duit a bheith faoi aois a 66 agus:

source: • Be unemployed (you must be fully unemployed or unemployed for at least 4 days out of 7)
ga: • A bheith dífhostaithe, (caithfidh tú bheith as obair ar feadh 4 lá ar a laghad as 7 lá leanúnach oibre)

source: • Have had a substantial loss of employment and as a result be unemployed for at least 4 days out of 7
ga: • Do fhostaíocht a bheith caillte agat agus a bheith as obair ar feadh 4 lá ar a laghad as 7 lá

source: • Be capable of work
ga: • A bheith ábalta obair a dhéanamh

source: • Be available for and genuinely seeking work
ga: • A bheith ag cuartú oibre agus a bheith ar fáil chun obair a dhéanamh

source: • Have enough social insurance (PRSI) contributions
ga: • Do dhóthain ranníocaíochtaí ÁSPC a bheith déanta agat

source: You can read more about the conditions for getting a jobseeker's payment and about the employment services the Department of Social Protection offers to jobseekers. There are some exceptions to the rules for pregnant women around the time of birth
ga: Is féidir leat tuilleadh a léamh faoi na coinníollacha d’íocaíocht cuardaitheora poist a fháil agus faoi na seirbhísí fostaíochta a chuireann an Roinn Coimirce Sóisialaí ar fáil do chuardaitheoirí poist

source: Jobseeker's Benefit and work
ga: Obair agus Sochar Cuardaitheora Poist

source: To get Jobseeker's Benefit you must be unemployed or have lost at least one day's employment and as a result be unemployed for at least 4 days out of 7 days
ga: Chun a bheith i dteideal Sochar Cuardaitheora Poist ní mór duit bheith dífhostaithe nó lá fostaíochta amháin a bheith caillte agat agus a bheith as obair ar feadh 4 lá ar a laghad as 7 lá leanúnach oibre

source: You may continue to get Jobseeker's Benefit if you can only find part-time or casual work
ga: Tá tuilleadh eolais faoi obair agus Sochar Cuardaitheora Poist ar fáil

source: Where a Jobseeker's Benefit recipient is working for part of a week, their entitlement will be based on a 5-day payment week
ga: Sa chás go bhfuil faighteoir an tSochair Chuardaitheora Poist ag oibriú ar feadh cuid den tseachtain, bunaítear a dteidlíocht ar sheachtain íocaíochta 5 lá

source: This means that for each day that a person is employed, 1/5th of the normal rate of Jobseeker's Benefit is deducted
ga: Ciallaíonn seo go n-asbhaintear 1/5 den ghnáthráta den Sochar Cuardaitheora Poist ar feadh gach lá a bhíonn an duine sin fostaithe

source: If they get part-time work for 2 days, they will get 3/5ths of the normal Jobseeker's Benefit for that week and if they get part-time work for 3 days they will get 2/5ths of the normal rate of Jobseeker’s Benefit for the week
ga: Má fhaigheann siad obair pháirtaimseartha ar feadh 2 lá, gheobhaidh siad 3/5 den ghnáthShochar Cuardaitheora Poist don tseachtain sin agus má fhaigheann siad obair pháirtaimseartha do 3 lá, gheobhaidh siad 2/5 den ghnáthráta den Sochar Cuardaitheora Poist don tseachtain

source: You must still be unemployed for at least 4 days out of 7 to claim Jobseeker's Benefit
ga: Ní mór duit bheith dífhostaithe go fóill ar feadh 4 lá as 7 lá chun Sochar Cuardaitheora Poist a éileamh

source: You can read FAQS about these changes
ga: Féadfaidh tú Ceisteanna Coitianta faoi na hathruithe seo a léamh anseo

source: There is an exemption from some of the rules for retained firefighters
ga: Tá díolúine ó roinnt de na rialacha ar fáil do chomhraiceoirí dóiteáin coinnithe

source: More information is available about work and Jobseeker’s Benefit
ga: Tá fáil ar thuilleadh faisnéise faoi Obair agus an Sochar Cuardaitheora Poist anseo

source: You must have suffered a substantial loss of employment in any period of 7 consecutive days to be eligible for Jobseeker's Benefit (casual workers and retained firefighters with no other employment are exempt from this rule)
ga: Ní mór gur chaill tú méid suntasach fostaíochta in aon tréimhse 7 lá as a chéile chun bheith incháilithe do Shochar Cuardaitheora Poist (tá oibrithe ócáideacha agus comhraiceoirí dóiteáin coinnithe nach bhfuil aon phost eile acu díolmhaithe ón riail sin)

source: This means that you must have lost at least one day's employment and as a result of this loss be unemployed for at least 4 days out of 7
ga: Ciallaíonn sé sin nach mór gur chaill tú fostaíocht aon lae amháin agus, mar thoradh ar an gcaillteanas sin, go mbeidh tú dífhostaithe ar feadh ceithre lá ar a laghad as gach seacht lá

source: Your earnings must also have been reduced because of the loss of employment
ga: Ní mór gur tháinig laghdú ar do thuilleamh freisin mar thoradh ar an gcaillteanas fostaíochta

source: Social insurance (PRSI) contributions
ga: Ranníocaíochtaí árachais shóisialaigh (ÁSPC)

source: To qualify for Jobseeker's Benefit, you must pay Class A, H or P PRSI contributions
ga: Chun a bheith i dteideal Sochar Cuardaitheora Poist ní mór duit ranníocaíochtaí rannóg A, H, nó P de ÁSPC a bheith íoctha agat

source: Class A is the one paid by most private sector employees
ga: Íocann for mhór d'fostaithe sa rannóg phríomháideach ranníocaíochtaí isteach i rannóg A

source: Class H is paid by soldiers, reservists and temporary army nurses, who do not qualify for Jobseeker's Benefit until they have left the army
ga: Íocann saighdiúirí, cúltacaí, agus banaltraí sealadach an airm, nach bhfuil i dteideal Sochar Cuardaitheora Poist go bhfágann siad an tarm, ranníocaíochtaí isteach i rannóg H

source: • At least 104 weeks PRSI paid since you first started work And
ga: • Tá ort 104 seachtain de ranníocaíochtaí a bheith íoctha agat ó thosaigh tú ag obair

source: • 39 weeks PRSI paid or credited in the relevant tax year (a minimum of 13 weeks must be paid contributions*) Or
ga: • Tá ort 39 ranníocaíochtaí a bheith íoctha agat nó a bheith creidiúnaithe duit sa bhliain cánach ábhartha (tá ort 13 den 39 ranníocaíochtaí ar a laghad a bheith agat*)

source: • 26 weeks PRSI paid in the relevant tax year and 26 weeks PRSI paid in the tax year immediately before the relevant tax year
ga: • 26 ranníocaíochtaí a bheith íoctha agat sa bhliain cánach ábhartha agus 26 ranníocaíochtaí a bheith íoctha sa bhliain roimh an bhliain cánach ábhartha

source: *If you do not have 13 paid contributions in the relevant tax year, you must have paid 13 contributions in any of the following years:
ga: * Mura mbíonn ort 13 ranníocaíocht a bheith íoctha agat sa bhliain chánach ábhartha tá ort na 13 ranníocaíocht a bheith íoctha agat in aon bhliain de na blianta seo leanas:

source: • The 2 tax years before the relevant tax year
ga: • An dá bhliain chánach deireanach roimh an mbliain cánach iomchuí,

source: • The last complete tax year
ga: • An bhliain chánach iomlán deireanach,

source: • The current tax year
ga: • An bhliain chánach reatha

source: The relevant tax year is the second last complete tax year before the year in which your claim is made. So, for claims made in 2017, the relevant tax year is 2015
ga: Is í an bhliain cánach ábhartha an dara bhliain dheireanach cánach roimh tús na bliana sochar, m.sh., i gcás éilimh a rinneadh i 2017, is é 2015 an Bhliain Chánach Ábhartha

source: There are a number of circumstances in which you can be awarded credited contributions
ga: Tá roinnt cásanna ann go dtabharfar ranníocaíochtaí creidiúnaithe duit

source: For example, pre-entry credits are given when you start employment for the first time in your working life
ga: Mar shampla, faigheann tú roinnt creidiúintí réamhiontráil nuair a thosnaíonn tú i bhfostaíocht don chéad uair

source: However, you can only qualify for Jobseeker's Benefit when you have actually paid 104 contributions
ga: Ciallaíonn sé seo go bhfuil tú i dteideal Sochar Cuardaitheora Poist chomh luath agus atá 104 ranníocaíochtaí déanta agat

source: Credits are also awarded while you are getting certain social welfare payments, including Jobseeker's Benefit (provided it is for 6 days), Illness Benefit and, in some cases, Jobseeker's Allowance
ga: Tugtar ranníocaíochtaí creidiúnaithe duit nuair a bhíonn tú ag tarraingt cinéalacha áirithe leasa shóisialaigh mar shampla, Sochar Cuardaitheora Poist (más do sé lá é), Líuntas Cuardaitheora Poist nó Sochar Breoiteachta

source: Contributions you have paid in other member states of the EU/EEA will be added to your Irish contributions
ga: Tógtar san áireamh ranníocaíochtaí atá déanta agat in aon cheann de stáit an AE/LEE chomh maith leo siúd atá déanta in Éirinn agat

source: If you are applying for Jobseeker's Benefit and need the contributions paid in another EU/EEA country to help you qualify, then your last contribution must have been in Ireland
ga: Má theastaíonn uait iarratas a dhéanamh ar Sochar Cuardaitheora Poist in Éirinn caithfidh na ranníocaíochtaí deireanacha bheith déanta in Éirinn agat

source: Under the Social Welfare (Consolidation) Act 2005 employers are obliged to register all employees for PRSI
ga: Faoin Acht Leasa Shóisialaigh (Comhdhlúthú) 2005, tá dualgas ar an bhfostóir gach fostaí a chlárú do ÁSPC

source: Read more in our document on your Employer's duty to pay social insurance
ga: Léigh tuilleadh inár gcáipéis ar Dhualgas an fhostóra árachas sóisialta a íoc

source: You may be disqualified from getting Jobseeker's Benefit for 9 weeks if you:
ga: Beidh cosc curtha ort Sochar Cuardaitheora Poist a tharraingt go ceann 9 seachtaine má:

source: • Left work voluntarily and without a reasonable cause
ga: • D'fhág tú an post go deonach agus gan cúis mhaith agat sin a dhéanamh

source: • Lost your job through misconduct
ga: • Chaill tú an post toisc do mí-iompar féin

source: • Refused an offer of suitable alternative employment or suitable training - if you have been on a penalty rate of JB for at least 21 days
ga: • Dhiúltaigh tú deis oiriúnach eile fostaíochta nó traenála

source: • Are aged under 55 and get a redundancy payment of more than €50,000
ga: • Tá tú faoi aois 55 agus gur bhfuair tú íocaíocht iomarcaíochta níos mó ná luach €50,000

source: The exact length of your disqualification (up to 9 weeks) will depend on the amount of redundancy payment you received
ga: Brathfidh an fhad a bheidh tú gan Sochar Cuardaitheora Poist (suas go 9 seachtainí) go díreach ar an méid íocaíocht scoir a fuair tú ag fágáil an phoist duit

source: If you are aged under 55 and get a redundancy payment of more than €50,000 you are disqualified from claiming Jobseeker's Benefit
ga: Ar aghaidh, má tá tú faoi bhun 55 agus má fhaigheann tú íocaíocht iomarcaíochta atá os cionn €50,000 dícháileofar tú ó Sochar Cuardaitheora Poist a éileamh ar feadh na tréimhsí ama seo a leanas

source: The table below shows how long you may be disqualified for
ga: Léiríonn an tábla thíos cé chomh fada a d’fhéadfá bheith dícháilithe

source: The length of the disqualification is at the discretion of the deciding officer (who can take your circumstances into account)
ga: Cé gurb éigeantach dícháiliú a ghearradh, is faoi rogha an oifigigh chinntithigh an fad a mhairfidh an dícháiliú (ar féidir leis/léi do chúinsí a chur san áireamh)

source: Any period of disqualification is subtracted from your total Jobseeker's Benefit entitlement
ga: Ba cheart duit a thabhairt faoi deara go mbaintear aon tréimhse dhícháilithe ó do theidlíocht iomlán i leith Sochar Cuardaitheora Poist

source: So if you are disqualified for 3 weeks (which is 18 days payment) your JB claim starts on day 19. Note that people who take voluntary redundancy and do not get a redundancy payment of over €50,000 can claim jobseeker's payments immediately
ga: Mar sin, má bhíonn tú dícháilithe ar feadh 3 seachtaine (arb ionann seo agus íocaíocht 18 lá), tosóidh d’éileamh ar SCP ar lá 19

source: │Amount of redundancy payment │Period of disqualification │
ga: │Méid na hÍocaíochta Iomarcaíochta │Tréimhse Dhícháilithe │

source: │€90,000.01 and over │9 weeks │
ga: │€90,000.01 agus os a chionn │9 Seachtaine │

source: Duration of Jobseeker's Benefit
ga: Fad an tSochair Chuardaitheora Poist

source: Jobseeker's Benefit is paid for 9 months (234 days) for people with 260 or more PRSI contributions paid
ga: Má bhí níos lú ná 260 ranníocaíocht íoctha agat, d’fhéadfaí Sochar Cuardaitheora Poist a íoc leat ar feadh 9 mí (234 lá) ar a mhéid

source: It is paid for 6 months (156 days) for people with fewer than 260 PRSI contributions paid
ga: Má tá tú faoi bhun 18 mbliana d’aois, ní bhfaighfeá Sochar Cuardaitheora Poist ach ar feadh 6 mhí (156 lá) ar a mhéid

source: There are some special provisions for older jobseekers
ga: Is ann do roinnt forálacha speisialta do chuardaitheoirí poist scothaosta

source: People over 65 who are claiming Jobseeker’s Benefit (JB), and who have at least 156 PRSI contributions, can continue to receive JB until their 66th birthday even if their claim is due to end before that date
ga: Daoine atá os cionn 65 bliain d’aois, atá ag éileamh Sochar Cuardaitheora Poist agus a bhfuil 156 ranníocaíocht ÁSPC ar a laghad déanta acu, is féidir leo leanúint le Sochar Cuardaitheora Poist a fháil go dtí go mbainfidh siad 66 bliain amach, fiú amháin i gcásanna ina bhfuil a n-éileamh le dul in éag roimh an dáta sin

source: For new JB claimants from 4 April 2013
ga: Eilitheoirí nua ón 4 Aibreán 2013 ar aghaidh

source: │Number of contributions │Duration of JB claim │
ga: │Líon na ranníocaíochtaí │Fad an éilimh ar SCP │

source: │260 or more │234 days (9 months) │
ga: │260 nó níos mó │234 lá (9 mí) │

source: │Less than 260 │156 days (6 months) │
ga: │Níos lú ná 260 │156 lá (6 mhí) │

source: Re-qualifying for Jobseeker's Benefit
ga: Athcháiliú don Sochar Cuardaitheora Poist

source: You can re-qualify for JB if:
ga: Féadfaidh tú athcháiliú don SCP má:

source: • You have used up your full JB entitlement (either 9 or 6 months)
ga: • D’úsáid tú do theidlíocht iomlán SCP (cibé acu 9 nó 6 mhí)

source: • You have paid 13 PRSI contributions for at least 13 weeks (these contributions can be counted only after you have claimed at least 156 days (6 months) of JB)
ga: • D’íoc tú 13 ranníocaíocht ÁSPC ar feadh 13 sheachtain ar a laghad (ní féidir na ranníocaíochtaí seo a chur san áireamh ach amháin tar éis duit 156 lá (6 mhÍ) den SCP a éileamh

source: However if you are working and claiming JB (systematic short-time workers and part-time workers) you cannot simply continue your JB claim when it is exhausted since you must have suffered a substantial loss of employment to re-qualify for JB, (unless you are a casual worker)
ga: Má tá tú ag oibriú agus ag éileamh SCP (oibrithe córasacha gearrthréimhseacha agus oibrithe páirtaimseartha), áfach, ní féidir leat díreach leanúint le SCP a éileamh nuair a chuirtear deireadh leis, mar gheall gur gá go raibh tú thíos le mórchaillteanas fostaíochta chun athcháiliú don SCP, (murar oibrí ócáideach thú)

source: If you have lost your job you will have suffered a substantial loss of employment
ga: Má chaill tú do phost beidh tú tar éis caillteanas suntasach fostaíochta a fhulaingt

source: If you are a part-time or systematic short-time worker DSP will look at your pattern of employment over the last 13 weeks or another representative period to find out whether you have suffered a substantial loss of employment
ga: Más oibrí páirtaimseartha nó oibrí gearr-ama córasach tú breathnóidh an Roinn Coimirce Sóisialaí ar do phatrún fostaíochta le 13 seachtain anuas nó le haghaidh tréimhse ionadaíche eile chun fáil amach ar fhulaing tú caillteanas suntasach fostaíochta

source: For example, if you are getting JB and working 3 days each week as a systematic short-time worker or a part-time worker and your employment pattern has not changed during the course of your JB claim, you will not have suffered a substantial loss of employment and will not re-qualify for Jobseeker’s Benefit when you exhaust your claim
ga: Mar shampla, má tá SCP á fháil agat agus má tá tú ag obair ar feadh 3 lá gach seachtain mar oibrí gearr-ama córasach nó oibrí páirtaimseartha agus murar athraigh do phatrún fostaíochta le linn d’éilimh ar SCP, ní bheidh caillteanas suntasach fostaíochta fulaingthe agat agus ní cháileoidh tú an athuair do Shochar Cuardaitheora Poist

source: However, if your JB claim ends and your 3 day week working week is then reduced to a 2 day week, you will have suffered a substantial loss of employment and may re-qualify for Jobseeker’s Benefit
ga: Má thagann deireadh le d’éileamh SCP agus má laghdaítear do sheachtain oibre 3 lá go seachtain 2 lá, áfach, beidh caillteanas suntasach fostaíochta fulaingthe agat agus is féidir go gcáileodh tú an athuair don Sochar Cuardaitheora Poist

source: If you claim JB for a period, sign off and then claim JB again within 26 weeks your claim may be linked to the earlier claim
ga: Má éilíonn tú SCP ar feadh tréimhse, má shíníonn den SCP agus má éilíonn tú SCP arís laistigh de 26 seachtain, d’fhéadfaí d’éileamh a nascadh leis an éileamh níos luaithe

source: This means that your claim is not treated as a new claim and:
ga: Ciallaíonn seo nach gcaitear le d’éileamh mar éileamh nua, agus:

source: • You do not have to wait for 3 days before getting your payment
ga: • Ní gá duit fanacht ar feadh 3 lá sula bhfaigheann tú d’íocaíocht

source: • The cumulative total of days from the previous claim is continued (so, for example, if you have used up 100 days of your total JB entitlement of 234 days you have 134 days remaining on your claim)
ga: • Cuirtear san áireamh an t-iomlán carnach laethanta ón éileamh roimhe sin san áireamh (mar shampla, má d’úsáid tú 100 lá de do theidlíocht iomlán SCP de 234 lá, tá 134 lá fágtha agat ar d’éileamh)

source: • The rate of JB is the same rate payable as on the previous claim, unless there has been a budgetary increase or change in family circumstances (such as a new child dependant)
ga: • Is ionann ráta an SCP agus an ráta a bhí iníoctha ar an éileamh roimhe sin, murar cuireadh méadú buiséadach i bhfeidhm nó murar tháinig athrú ar chúinsí teaghlaigh (ar nós cleithiúnaí nua linbh)

source: If your JB claim does not link to a previous claim it is treated as a new claim
ga: Mura nasctar d’éileamh SCP le héileamh roimhe sin, caitear leis mar éileamh nua

source: You must wait for 3 days before getting a payment and your cumulative total of days starts from the first day of payment
ga: Ní mór duit fanacht ar feadh 3 lá sula bhfaigheann tú íocaíocht agus tosaíonn do líon carnach iomlán laethanta ón gcéad lá fostaíochta

source: You can read more about linking claims including information on linking to a different scheme (such as Illness Benefit) and linking to an earlier JB claim through a different scheme or period spent in training or on an employment scheme
ga: Féadfaidh tú níos mó a léamh faoi éilimh a nascadh ar láithreán gréasáin an RCS, lena n-áirítear faisnéis ar nascadh le scéim éagsúil (ar nós Sochar Breoiteachta) agus nascadh le héileamh SCP níos luaithe trí scéim éagsúil nó tréimhse a caitheadh faoi oiliúint nó i scéim fostaíochta

source: Short-term employment or training
ga: Fostaíocht ghearrthéarmach nó oiliúint

source: The Department of Social Protection operates a fast-tracking system for people who sign off to take up work for a short period (up to 12 weeks) or to go on a short training course (up to 12 weeks)
ga: Tá córas mear oibrithe ag an Roinn Coimirce Sóisialaí do chustaiméirí a shíníonn d’íocaíocht cuardaitheora poist chun obair ghearrthéarmach a ghlacadh (suas go 12 seachtaine) nó chun dul ar ghearrchúrsa oiliúna (suas go 12 seachtaine)

source: This ensures that your payment is re-instated without delay
ga: Cinntíonn sé sin go n-atosófar d’íocaíocht gan mhoill

source: It is important that you inform your Intreo Centre or local Social Welfare Branch Office in advance that you are taking up work or training
ga: Tá sé tábhachtach go ndéarfá le d’oifig leasa shóisialaigh áitiúil é roimh ghlacadh le hobair nó dul ar chúrsa oiliúna

source: Your Rent Supplement claim can also be suspended for up to 12 weeks
ga: D’fhéadfadh d’éileamh ar Fhorlíonadh Cíos a chur ar fionraí ar feadh tréimhse suas le 12 seachtain

source: Jobseeker's Benefit is not paid for the first 3 days you are unemployed (the first 3 days are any 3 days, not necessarily consecutive, in a period of 7 consecutive days)
ga: Ní íoctar Sochar Cuardaitheora Poist don chéad 3 lá den fhostaíocht bhriste. Séard is fostaíocht bhriste ann ná aon 3 lá (ní gá dóibh a bheith leanúnach) in aon tréimhse 7 lá leanúnach

source: If you are unemployed for a second time within 26 weeks of your last JB payment your application for Jobseeker's Benefit is not treated as a new claim and you do not have another 3 days of non-payment. See 'Linking claims' above
ga: Má tharlaíonn dhá bhriseadh dá leithéid seo in aon tréimhse 13 seachtain níl aon bhriseadh san iarratas agus ní chaillfidh tú 3 lá eile gan íocaíocht

source: Weekly Jobseeker's Benefit payment in 2016 and up to 9 March 2017
ga: Rátaí seachtainiúil maidir le Sochar Cuardaitheora Poist ó 9 Márta 2017

source: │Average weekly │Personal │Increase for a │Increase for a │
ga: │Meánthuilleamh│Ráta │Méadú do Dhuine │Ardú │

source: │earnings │rate │qualified adult │qualified child │
ga: │seachtainiuil │pearsanta│Fásta Cáilithe │Cleithiúnaí│

source: │€300 or more │€188.00 │€124.80 │ │
ga: │Idir €150 agus│€124.60 │€83.00 │ │

source: │€300 or more │€193.00 │€128.10 │ │
ga: │Níos mó ná │€193.00 │€128.10 │ │

source: You get a personal rate and may get an increase for an adult dependant and child dependant (see below)
ga: Gheobhaidh tú ráta pearsanta agus is féidir méadú do dhuine fásta cleithiúnach agus do leanbh cleithiúnach a fháil

source: Your average weekly earnings do not affect the amount you get for a child dependent
ga: Ní bhíonn aon tionchar ar mhéadú do leanbh cleithiúnach ag do mheántuilleamh seachtainiúil

source: Jobseeker's Benefit rates are graduated according to your earnings in the relevant tax year
ga: Tá rátaí Sochair Cuardaitheora Poist grádaithe de réir tuillimh sa bhliain cánach ábhartha d'éilimh

source: Your average weekly earnings are your gross yearly earnings from employment divided by the number of paid A, H or P contributions in the relevant tax year
ga: Is é atá i do mheántuilleamh seachtainiúil ná d’olltuilleamh bliantúil ó fhostaíocht roinnte faoin líon ranníocaíochtaí A, H nó P atá íoctha sa Bhliain Chánach Ábhartha

source: The relevant tax year is 2 years before the year of your claim
ga: Is an Bhliain Chánach Ábhartha í dhá bhliain roimh dháta d'éileamh
